app/views/orders/_form.html.erb

<%= form_for([@product, @product.orders.build]) do |f| %>
---
SELECT "orders".* FROM "orders" WHERE "orders"."product_id" = ?  [["product_id", 6]]