app/controllers/orders_controller.rb

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "orders" ("customer", "count", "product_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["customer", "Barry"], ["count", 4], ["product_id", 1], ["created_at", "2015-01-12 21:21:18.956938"], ["updated_at", "2015-01-12 21:21:18.956938"]]
---
	def create
		@product = Product.find(params[:product_id])
		@order = @product.orders.create(order_params)

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "orders".* FROM "orders" WHERE "orders"."product_id" = ? AND "orders"."id" = ? LIMIT 1  [["product_id", 1], ["id", 7]]
DELETE FROM "orders" WHERE "orders"."id" = ?  [["id", 7]]
---
	def destroy
		@product = Product.find(params[:product_id])
		@order = @product.orders.find(params[:id])
		@order.destroy