app/controllers/products_controller.rb

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "products" SET "description" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["description", "This is a widget thing"], ["updated_at", "2015-01-11 19:41:28.100450"], ["id", 1]]
---
	def update
		@product = Product.find(params[:id])

		if @product.update(product_params)

INSERT INTO "products" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Widget"], ["description", "This is a widget"], ["created_at", "2015-01-11 16:18:48.804282"], ["updated_at", "2015-01-11 16:18:48.804282"]]
---
	def create
		@product = Product.new(product_params)

		if @product.save