app/views/products/show.html.erb

<h2>Orders</h2>
<%= render @product.orders %>
---
SELECT "orders".* FROM "orders" WHERE "orders"."product_id" = ?  [["product_id", 1]]